from django.core.management.base import BaseCommand
from accounts.models import Skill


SKILLS = [
    # Образование
    "Математика",
    "Подготовка к ЕГЭ по математике",
    "Олимпиадная математика",
    "Физика",
    "Информатика",
    "Химия",
    "Биология",
    "Английский язык",
    "Немецкий язык",
    "Французский язык",
    "Испанский язык",
    "Итальянский язык",
    "Обществознание",
    "История",
    "Философия",
    "Психология",

    # IT
    "Python",
    "Django",
    "HTML",
    "CSS",
    "JavaScript",
    "Git",
    "SQL",
    "Алгоритмы",
    "Unity",
    "Blender",
    "Figma",
    "UI/UX дизайн",

    # Cпорт
    "Футбол",
    "Баскетбол",
    "Волейбол",
    "Шахматы",
    "Горные лыжи",
    "Коньки",
    "Теннис",
    "Настольный теннис",
    "Хоккей",
    "Карточные игры",
    "Киберспорт",

    # Хобби
    "Вокал",
    "Фотография",
    "Видеомонтаж",
    "Рисование",
    "3D моделирование",
    "Танцы",
    "Кулинария",
    "Инвестирование",
    "Волонтерство",
    "Путешествия",
    "Косплей",
    "Квадробинг",
    "Видеоигры",
    "Блогинг",
    "Растениеводство",
    "Шитье",
    "Рукоделие",
    "Чтение",

    #Музыкальные инструменты
    "Гитара",
    "Фортепиано",
    "Скрипка",
    "Ударные инструменты",
    "Духовые инструменты",
]


class Command(BaseCommand):
    help = "Загрузить навыки в БД"

    def handle(self, *args, **kwargs):
        created_count = 0

        for skill_name in SKILLS:
            _, created = Skill.objects.get_or_create(name=skill_name.strip())
            if created:
                created_count += 1

        self.stdout.write(
            self.style.SUCCESS(
                f"Навыки загружены. Добавлено: {created_count}"
            )
        )
